tangyangguang/Esp32_Faucet/src/main.cpp
#include <Arduino.h>
#include <Esp32Base.h>
#include <Wire.h>

#include "app/AppController.h"
#include "app/BeepDriver.h"
#include "app/CalibrationSampleStore.h"
#include "app/CalibrationSessionStore.h"
#include "app/ConfigStore.h"
#include "app/DateTimeUtils.h"
#include "app/DisplayPresenter.h"
#include "app/Esp32BaseConfigBackend.h"
#include "app/Esp32BaseWaterRecordBackend.h"
#include "app/FaucetAppConfig.h"
#include "app/FilterStore.h"
#include "app/MeteringSchemeStore.h"
#include "app/StatisticsStore.h"
#include "app/TimeUtils.h"
#include "app/WaterRecordCalibrationStore.h"
#include "app/WaterRecordFileStore.h"
#include "app/WaterRecordStore.h"
#include "app/WaterPulseTraceStore.h"
#include "drivers/Ads1115Reader.h"
#include "drivers/BoardPins.h"
#include "drivers/FlowPulseReader.h"
#include "drivers/GpioButtonReader.h"
#include "drivers/Lcd1602Display.h"
#include "drivers/PwmBeepHardware.h"
#include "drivers/PwmValveHardware.h"
#include "drivers/RtcClock.h"
#include "web/FaucetWeb.h"

#include <algorithm>
#include <new>
#include <time.h>

namespace {
constexpr const char* kFirmwareName = "esp32-faucet";
constexpr const char* kFirmwareVersion = "0.1.0-dev";
constexpr const char* kDefaultWebUser = "admin";
constexpr const char* kDefaultWebPassword = "admin";
constexpr std::size_t kRamRecordCapacity = 128;
constexpr std::size_t kRamRecordCalibrationCapacity = 32;
constexpr std::size_t kWaterRecordCapacity = 20000;
constexpr std::size_t kWaterRecordCalibrationCapacity = 512;
constexpr std::size_t kPulseTraceCapacity = faucet::kRecentPulseTraceCount;
constexpr std::size_t kPulseTraceMaxSamples =
    static_cast<std::size_t>(faucet::kRecentPulseTraceCount) * faucet::kPulseTraceMaxRawEdgesPerTrace;
constexpr std::uint32_t kRuntimePersistenceRetryIntervalMs = 30000UL;
constexpr std::size_t kMaxFlowPulsesPerTick = 32;
constexpr std::uint32_t kI2cTimeoutMs = 20UL;
constexpr const char* kWaterRecordPath = "/faucet_records_v2.bin";
constexpr const char* kWaterRecordCalibrationPath = "/faucet_record_cal_v1.bin";
constexpr const char* kMeteringSchemePath = "/faucet_metering_schemes_v6.bin";
constexpr const char* kCalibrationSessionPath = "/faucet_cal_session_v1.bin";
constexpr const char* kCalibrationSessionTracePath = "/faucet_cal_session_traces_v1.bin";
constexpr const char* kCalibrationLongTermSamplesPath = "/faucet_cal_samples_v1.bin";

class PersistentRecordWriter : public faucet::WaterRecordWriter, public faucet::WaterRecordReader {
public:
    PersistentRecordWriter() : fileStore_(nullptr), ramStore_(records_, kRamRecordCapacity) {}

    void setFileStore(faucet::WaterRecordFileStore* store) {
        fileStore_ = store;
    }

    bool append(const faucet::WaterRecord& record) override {
        if (fileStore_ && fileStore_->append(record)) {
            return true;
        }
        return ramStore_.append(record);
    }

    std::size_t rewriteBootRelativeTimes(std::uint32_t bootId, std::uint32_t bootStartRealSec) {
        if (fileStore_ && fileStore_->ready()) {
            return fileStore_->rewriteBootRelativeTimes(bootId, bootStartRealSec);
        }
        return ramStore_.rewriteBootRelativeTimes(bootId, bootStartRealSec);
    }

    std::size_t readPage(std::size_t pageIndex,
                         std::uint16_t pageSize,
                         faucet::WaterRecord* output,
                         std::size_t outputCapacity) const override {
        if (fileStore_ && fileStore_->ready()) {
            return fileStore_->readPage(pageIndex, pageSize, output, outputCapacity);
        }
        return ramStore_.readPage(pageIndex, pageSize, output, outputCapacity);
    }

    std::size_t count() const override {
        return fileStore_ && fileStore_->ready() ? fileStore_->count() : ramStore_.count();
    }

    bool ready() const override {
        return (fileStore_ && fileStore_->ready()) || ramStore_.ready();
    }

    const char* storageName() const override {
        return fileStore_ && fileStore_->ready() ? fileStore_->storageName() : ramStore_.storageName();
    }

    faucet::WaterRecordFileStatus status() const override {
        if (fileStore_) {
            const faucet::WaterRecordFileStatus fileStatus = fileStore_->status();
            if (fileStatus != faucet::WaterRecordFileStatus::Ready) {
                return fileStatus;
            }
        }
        return fileStore_ && fileStore_->ready() ? fileStore_->status() : ramStore_.status();
    }

private:
    faucet::WaterRecordFileStore* fileStore_;
    faucet::WaterRecord records_[kRamRecordCapacity]{};
    faucet::WaterRecordStore ramStore_;
};

class PersistentRecordCalibrationStore : public faucet::WaterRecordCalibrationReader,
                                         public faucet::WaterRecordCalibrationWriter {
public:
    PersistentRecordCalibrationStore()
        : fileStore_(nullptr), ramStore_(calibrations_, kRamRecordCalibrationCapacity) {}

    void setFileStore(faucet::WaterRecordCalibrationFileStore* store) {
        fileStore_ = store;
    }

    bool upsert(const faucet::WaterRecordCalibration& calibration) override {
        if (fileStore_ && fileStore_->ready()) {
            return fileStore_->upsert(calibration);
        }
        return ramStore_.upsert(calibration);
    }

    bool find(const faucet::WaterRecord& record, faucet::WaterRecordCalibration& output) const override {
        if (fileStore_ && fileStore_->ready()) {
            return fileStore_->find(record, output);
        }
        return ramStore_.find(record, output);
    }

    std::size_t findAny(const faucet::WaterRecord* records,
                        std::size_t recordCount,
                        faucet::WaterRecordCalibration* output,
                        bool* found) const override {
        if (fileStore_ && fileStore_->ready()) {
            return fileStore_->findAny(records, recordCount, output, found);
        }
        return ramStore_.findAny(records, recordCount, output, found);
    }

    std::size_t count() const override {
        return fileStore_ && fileStore_->ready() ? fileStore_->count() : ramStore_.count();
    }

