tangyangguang/Esp32_Faucet/src/main.cpp
    bool ready() const override {
        return (fileStore_ && fileStore_->ready()) || ramStore_.ready();
    }

    const char* storageName() const override {
        return fileStore_ && fileStore_->ready() ? fileStore_->storageName() : ramStore_.storageName();
    }

private:
    faucet::WaterRecordCalibrationFileStore* fileStore_;
    faucet::WaterRecordCalibration calibrations_[kRamRecordCalibrationCapacity]{};
    faucet::WaterRecordCalibrationStore ramStore_;
};

faucet::Esp32BaseConfigBackend g_configBackend;
faucet::ConfigStore g_configStore(g_configBackend);
faucet::SystemConfig g_config{};
faucet::StatisticsStore g_statistics;
faucet::FilterStore* g_filters = nullptr;
faucet::Esp32BaseWaterRecordBackend g_waterRecordBackend;
faucet::WaterRecordFileStore g_waterRecordFile(g_waterRecordBackend, kWaterRecordPath, kWaterRecordCapacity);
faucet::WaterRecordCalibrationFileStore g_recordCalibrationFile(
    g_waterRecordBackend,
    kWaterRecordCalibrationPath,
    kWaterRecordCalibrationCapacity);
faucet::MeteringSchemeStore g_meteringSchemes(g_waterRecordBackend, kMeteringSchemePath);
faucet::CalibrationSessionFileStore g_calibrationSession(g_waterRecordBackend, kCalibrationSessionPath);
faucet::CalibrationSessionTraceStore g_calibrationSessionTraces(g_waterRecordBackend, kCalibrationSessionTracePath);
faucet::CalibrationLongTermSampleStore g_calibrationLongTermSamples(g_waterRecordBackend,
                                                                    kCalibrationLongTermSamplesPath);
PersistentRecordWriter g_records;
PersistentRecordCalibrationStore g_recordCalibrations;
faucet::WaterPulseTrace* g_pulseTraceRecords = nullptr;
faucet::WaterPulseTraceSample* g_pulseTraceSamples = nullptr;
faucet::WaterPulseTraceStore* g_pulseTraces = nullptr;
faucet::AppController* g_app = nullptr;
faucet::GpioButtonReader g_buttons(faucet::kPinButtonCancel,
                                   faucet::kPinButtonOk,
                                   faucet::kPinButtonPlus,
                                   faucet::kPinButtonMinus);
faucet::FlowPulseReader g_flowPulses(faucet::kPinFlow);
faucet::Ads1115Reader g_ads1115(0x48);
faucet::WaterSensorManager g_waterSensors(g_ads1115);
faucet::PwmValveHardware g_valveHardware(faucet::kPinValve, faucet::kLedcChannelValve);
faucet::BeepDriver g_beep;
faucet::PwmBeepHardware g_beepHardware(faucet::kPinBeep, faucet::kLedcChannelBeep);
faucet::RtcClock g_rtc(faucet::kPinI2cSda, faucet::kPinI2cScl);
faucet::Lcd1602Display g_lcd(faucet::kPinI2cSda, faucet::kPinI2cScl);
faucet::DisplayPresenter* g_display = nullptr;
faucet::DisplayFrame g_lastDisplayFrame{faucet::DisplayPage::Sleep, false, {}, {}};
bool g_persistenceFailureLogged = false;
bool g_runtimePersistenceRetryActive = false;
bool g_rebuildRecordStoreAfterFormatFs = false;
std::uint32_t g_lastRuntimePersistenceFailureMs = 0;
std::uint32_t g_lastDisplayMs = 0;
std::uint32_t g_lastDroppedPulsesLogged = 0;
std::uint32_t g_lastDroppedPulsesLogMs = 0;
bool g_bootRelativeTimesRewritten = false;
std::uint32_t g_lastLoopStartUs = 0;
std::uint32_t g_maxLoopIntervalUs = 0;
std::uint32_t g_maxAppTickUs = 0;
std::uint32_t g_maxBaseHandleUs = 0;
bool g_baseBeginComplete = false;
bool g_littleFsInitComplete = false;
bool g_configInitComplete = false;
bool g_recordStoreInitComplete = false;
bool g_traceStoreInitComplete = false;
bool g_runtimeStateInitComplete = false;
bool g_appControllerInitComplete = false;
bool g_valveClosedApplied = false;
bool g_otaMarkValidAttempted = false;

void configureBase() {
    Esp32Base::setFirmwareInfo(kFirmwareName, kFirmwareVersion, __DATE__ " " __TIME__);

#if ESP32BASE_ENABLE_WEB
    Esp32BaseWeb::setDefaultAuth(kDefaultWebUser, kDefaultWebPassword);
    Esp32BaseWeb::setDeviceName("首页");
    Esp32BaseWeb::setHomePath("/index");
    Esp32BaseWeb::setHomeMode(Esp32BaseWeb::HOME_COMBINED);
    Esp32BaseWeb::setSystemNavMode(Esp32BaseWeb::SYSTEM_NAV_SECTION);
    if (!faucet::registerFaucetAppConfig()) {
        ESP32BASE_LOG_E("app", "app config registration failed");
    }
    if (!faucet::registerFaucetWeb()) {
        ESP32BASE_LOG_E("app", "faucet web route registration failed");
    }
#endif
}

void feedStartupWatchdog() {
#if ESP32BASE_ENABLE_WATCHDOG
    Esp32BaseWatchdog::feed();
#endif
}

void logStartupPhase(const char* phase) {
    ESP32BASE_LOG_D("app", "startup_phase=%s", phase ? phase : "-");
    feedStartupWatchdog();
}

void initializeI2cBus() {
    Wire.begin(faucet::kPinI2cSda, faucet::kPinI2cScl);
    Wire.setTimeOut(kI2cTimeoutMs);
}

const char* configLoadStatusName(faucet::ConfigStore::LoadStatus status) {
    switch (status) {
        case faucet::ConfigStore::LoadStatus::Defaults:
            return "defaults";
        case faucet::ConfigStore::LoadStatus::LoadedCurrent:
            return "loaded_current";
    }
    return "unknown";
}

void logSystemConfigStatus() {
    const faucet::ConfigStore::LoadStatus status = g_configStore.lastSystemConfigLoadStatus();
    ESP32BASE_LOG_I("app",
                    "system config load status=%s raw_version=%ld target_version=%ld",
                    configLoadStatusName(status),
                    static_cast<long>(g_configStore.lastSystemConfigRawVersion()),
                    static_cast<long>(g_configStore.currentSystemConfigVersion()));
    if (status == faucet::ConfigStore::LoadStatus::Defaults &&
        g_configStore.lastSystemConfigRawVersion() != g_configStore.currentSystemConfigVersion()) {
        ESP32BASE_LOG_W("app", "system config version mismatch, defaults used until next save");
    }
}

void checkFileSystemCapacity() {
#if ESP32BASE_ENABLE_FS
    if (!Esp32BaseFs::isReady()) {
        return;
    }
    constexpr std::size_t kLowFreeBytes = 350UL * 1024UL;
    const std::size_t freeBytes = Esp32BaseFs::freeBytes();
    if (freeBytes < kLowFreeBytes) {
        ESP32BASE_LOG_W("app",
                        "LittleFS low free space: free=%lu total=%lu used=%lu",
                        static_cast<unsigned long>(freeBytes),
                        static_cast<unsigned long>(Esp32BaseFs::totalBytes()),
                        static_cast<unsigned long>(Esp32BaseFs::usedBytes()));
    }
#endif
}

std::uint32_t localSecondsFromUnix(std::uint32_t timestamp) {
    time_t value = static_cast<time_t>(timestamp);
    struct tm localTime {};
    localtime_r(&value, &localTime);
    const std::uint16_t year = static_cast<std::uint16_t>(localTime.tm_year + 1900);
    const std::uint8_t month = static_cast<std::uint8_t>(localTime.tm_mon + 1);
    const std::uint8_t day = static_cast<std::uint8_t>(localTime.tm_mday);
    return faucet::secondsSince2000(year,
                                    month,
                                    day,
                                    static_cast<std::uint8_t>(localTime.tm_hour),
                                    static_cast<std::uint8_t>(localTime.tm_min),
                                    static_cast<std::uint8_t>(localTime.tm_sec));
}

std::uint32_t currentSeconds() {
#if ESP32BASE_ENABLE_NTP
    const Esp32BaseNtp::TimeSnapshot time = Esp32BaseNtp::snapshot();
    if (time.synced) {
        return localSecondsFromUnix(time.epochSec);
    }
    return time.uptimeSec;
#else
    return millis() / 1000UL;
#endif
}

std::uint32_t currentBootId() {
#if ESP32BASE_ENABLE_NTP
    return Esp32BaseNtp::snapshot().bootId;
#else
    return 0;
#endif
}

